[
    {
        "position": "Analyst",
        "company": "Deloitte Consulting",
        "department": "Government and Public Services (GPS)",
        "start": {
            "year": 2021,
            "month": "February",
            "monthIndex": 1
        },
        "end": {
            "year": 0,
            "month": "",
            "monthIndex": 0
        },
        "description": "I use ServiceNow to help in the digital transformation of public-sector clients. I perform root-cause analysis and implement technical solutions for various client issues on both out-of-the-box modules and custom-made applications."
    },
    {
        "position": "Junior ServiceNow Developer",
        "company": "UC Davis",
        "department": "Information and Education Technology, Service Management",
        "start": {
            "year": 2020,
            "month": "October",
            "monthIndex": 9
        },
        "end": {
            "year": 2021,
            "month": "January",
            "monthIndex": 0
        },
        "description": "Worked within an agile team to develop web applications for the university. Participate in designing, coding and documenting specifications of applications. Work collaboratively with senior developers and other application developers within the application development team throughout the development lifecycle. Take and complete tasks for the development project with guidance from team members, department leadership and stakeholders to produce quality software."
    },
    {
        "position": "Student ServiceNow Developer (Student Supervisor)",
        "company": "UC Davis",
        "department": "Information and Education Technology, Service Management",
        "start": {
            "year": 2020,
            "month": "January",
            "monthIndex": 0
        },
        "end": {
            "year": 2020,
            "month": "September",
            "monthIndex": "8"
        },
        "description": "As a student supervisor, I took on additional responsibilities and worked on larger, more complex projects for the developement team. I participate in Sprint planning meetings and am able to delegate work to the other developers. I have also worked on projects like the Mobile Agent app and Virtual Agent."
    },
    {
        "position": "Student ServiceNow Developer",
        "company": "UC Davis",
        "department": "Information and Education Technology, Service Management",
        "start": {
            "year": 2019,
            "month": "June",
            "monthIndex": 5
        },
        "end": {
            "year": 2020,
            "month": "January",
            "monthIndex": "0"
        },
        "description": "I utilized Javascript, CSS, HTML, and the features of the NOW Platform to develop enterprise-scale applications and services for the university. I created widgets, configured catalog forms, and edited workflows on the university's IT service portal, Service Hub."
    },
    {
        "position": "Computer Lab Consultant",
        "company": "UC Davis",
        "department": "Information and Education Technology, Computer Lab Management",
        "start": {
            "year": 2018,
            "month": "January",
            "monthIndex": 1
        },
        "end": {
            "year": 2019,
            "month": "June",
            "monthIndex": 5
        },
        "description": "I ensured that students, staff, and faculty had satisfactory experiences in the school computer labs. I provided customer service through troubleshooting printer, computer, account login, and other technology-based issues."
    }
]